# MarkerSize Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayMarkersAndTextSettings..::..MarkerSize Property
AnalysisDisplayMarkersAndTextSettings Class See Also
---
Size of marker.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double MarkerSize { get; set; }
```

Visual Basic
---
```text
Public Property MarkerSize As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MarkerSize {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentsInconsistentException | When setting this property: markerSize is negative |

# See Also
AnalysisDisplayMarkersAndTextSettings Class
Autodesk.Revit.DB.Analysis Namespace